Realeed/Silabs_BTMesh/EFR32xG22_btmesh_soc_lightness_server/gecko_sdk_4.4.1/app/btmesh/common/btmesh_lighting_server/sl_btmesh_lighting_server.c
static sl_status_t generic_server_publish(uint16_t model_id,
                                          uint16_t element_index,
                                          mesh_generic_state_t kind);

static void generic_server_register_handler(uint16_t model_id,
                                            uint16_t elem_index,
                                            mesh_lib_generic_server_client_request_cb cb,
                                            mesh_lib_generic_server_change_cb ch,
                                            mesh_lib_generic_server_recall_cb recall);

static sl_status_t lightness_update(uint16_t element_index,
                                    uint32_t remaining_ms,
                                    mesh_generic_state_t kind);

#ifdef SL_CATALOG_BTMESH_SCENE_SERVER_PRESENT
static void scene_server_reset_register_impl(uint16_t elem_index);
#endif

// Timer handles
static app_timer_t lighting_pri_level_move_timer;
static app_timer_t lighting_transition_complete_timer;
static app_timer_t lighting_level_transition_complete_timer;
static app_timer_t lighting_onoff_transition_complete_timer;
static app_timer_t lighting_delayed_pri_level_timer;
static app_timer_t lighting_delayed_lightness_request_timer;
static app_timer_t lighting_delayed_onoff_request_timer;
static app_timer_t lighting_state_store_timer;

// Timer callbacks
static void lighting_pri_level_move_timer_cb(app_timer_t *handle,
                                             void *data);
static void lighting_transition_complete_timer_cb(app_timer_t *handle,
                                                  void *data);
static void lighting_level_transition_complete_timer_cb(app_timer_t *handle,
                                                        void *data);
static void lighting_onoff_transition_complete_timer_cb(app_timer_t *handle,
                                                        void *data);
static void lighting_delayed_pri_level_timer_cb(app_timer_t *handle,
                                                void *data);
static void lighting_delayed_lightness_request_timer_cb(app_timer_t *handle,
                                                        void *data);
static void lighting_delayed_onoff_request_timer_cb(app_timer_t *handle,
                                                    void *data);
static void lighting_state_store_timer_cb(app_timer_t *handle,
                                          void *data);

/*******************************************************************************
 * Get current lightness value
 *
 * @return Current lightness
 ******************************************************************************/
uint16_t sl_btmesh_get_lightness_current(void)
{
  return lightbulb_state.lightness_current;
}

/*******************************************************************************
 * Set current lightness value
 *
 * @param[in] lightness  Current lightness
 ******************************************************************************/
void sl_btmesh_set_lightness_current(uint16_t lightness)
{
  if (lightness != lightbulb_state.lightness_current) {
    lightbulb_state.lightness_current = lightness;
    lightbulb_state_changed();
  }
}

/*******************************************************************************
 * Get target lightness value
 *
 * @return  Target lightness
 ******************************************************************************/
uint16_t sl_btmesh_get_lightness_target(void)
{
  return lightbulb_state.lightness_target;
}

/*******************************************************************************
 * Set target lightness value
 *
 * @param[in] lightness  Target lightness
 ******************************************************************************/
void sl_btmesh_set_lightness_target(uint16_t lightness)
{
  if (lightness != lightbulb_state.lightness_target) {
    lightbulb_state.lightness_target = lightness;
    lightbulb_state_changed();
  }
}

/*******************************************************************************
 * Get default lightness value
 *
 * @return  Default lightness
 ******************************************************************************/
uint16_t sl_btmesh_get_lightness_default(void)
{
  return lightbulb_state.lightness_default;
}

/*******************************************************************************
 * Set default lightness value
 *
 * @param[in] lightness  Default lightness
 ******************************************************************************/
void sl_btmesh_set_lightness_default(uint16_t lightness)
{
  if (lightness != lightbulb_state.lightness_default) {
    lightbulb_state.lightness_default = lightness;
    lightbulb_state_changed();
  }
}

/*******************************************************************************
 * Set last lightness value
 *
 * @param[in] lightness  Last lightness
 ******************************************************************************/
void sl_btmesh_set_lightness_last(uint16_t lightness)
{
  if (lightness != lightbulb_state.lightness_last) {
    lightbulb_state.lightness_last = lightness;
    lightbulb_state_changed();
  }
}

/*******************************************************************************
 * Gets default lightness value on power up
 *
 * @return  Default lightness on power up
 ******************************************************************************/
uint16_t sl_btmesh_get_lightness_onpowerup(void)
{
  return lightbulb_state.onpowerup;
}

#if defined(SL_BTMESH_LIGHTING_SERVER_DEBUG_PRINTS_FOR_STATE_CHANGE_EVENTS_CFG_VAL) \
  && SL_BTMESH_LIGHTING_SERVER_DEBUG_PRINTS_FOR_STATE_CHANGE_EVENTS_CFG_VAL
/***************************************************************************//**
 * This function prints debug information for mesh server state change event.
 *
 * @param[in] evt  Pointer to mesh_lib_generic_server_state_changed event.
 ******************************************************************************/
static void server_state_changed(sl_btmesh_evt_generic_server_state_changed_t *evt)
{
  int i;

