Realeed/Silabs_BTMesh/EFR32xG22_btmesh_soc_lightness_server/gecko_sdk_4.4.1/app/btmesh/common/btmesh_lighting_server/sl_btmesh_lighting_server.c
      onoff_update(element_index, transition_ms);

      if (request->on_off == MESH_GENERIC_ON_OFF_STATE_OFF) {
        lightbulb_state.lightness_target = 0;
      } else {
        // restore last brightness
        lightbulb_state.lightness_target = lightbulb_state.lightness_last;
      }
      sl_btmesh_lighting_set_level(lightbulb_state.lightness_target,
                                   transition_ms);
      // lightbulb current state will be updated when transition is complete
      sl_status_t sc = app_timer_start(&lighting_onoff_transition_complete_timer,
                                       transition_ms,
                                       lighting_onoff_transition_complete_timer_cb,
                                       NO_CALLBACK_DATA,
                                       false);
      app_assert_status_f(sc, "Failed to start ON/OFF Transition Complete timer");
    }
    lightbulb_state_changed();

    // State has changed, so the current scene number is reset
    scene_server_reset_register(element_index);
  }

  uint32_t remaining_ms = delay_ms + transition_ms;
  if (request_flags & MESH_REQUEST_FLAG_RESPONSE_REQUIRED) {
    onoff_response(element_index, client_addr, appkey_index, remaining_ms);
  }
  onoff_update_and_publish(element_index, remaining_ms);

  // publish to bound states
  generic_server_publish(MESH_LIGHTING_LIGHTNESS_SERVER_MODEL_ID,
                         element_index,
                         mesh_lighting_state_lightness_actual);
}

/***************************************************************************//**
 * This function is a handler for generic on/off change event.
 *
 * @param[in] model_id       Server model ID.
 * @param[in] element_index  Server model element index.
 * @param[in] current        Pointer to current state structure.
 * @param[in] target         Pointer to target state structure.
 * @param[in] remaining_ms   Time (in milliseconds) remaining before transition
 *                           from current state to target state is complete.
 ******************************************************************************/
static void onoff_change(uint16_t model_id,
                         uint16_t element_index,
                         const struct mesh_generic_state *current,
                         const struct mesh_generic_state *target,
                         uint32_t remaining_ms)
{
  (void)model_id;
  (void)element_index;
  (void)target;
  (void)remaining_ms;

  if (current->on_off.on != lightbulb_state.onoff_current) {
    log_info("ON/OFF state changed %u to %u" NL,
             lightbulb_state.onoff_current,
             current->on_off.on);

    lightbulb_state.onoff_current = current->on_off.on;
    lightbulb_state_changed();
  } else {
    log_info("Dummy ON/OFF change - same state as before" NL);
  }
}

/***************************************************************************//**
 * This function is a handler for generic on/off recall event.
 *
 * @param[in] model_id       Server model ID.
 * @param[in] element_index  Server model element index.
 * @param[in] current        Pointer to current state structure.
 * @param[in] target         Pointer to target state structure.
 * @param[in] transition_ms  Transition time (in milliseconds).
 ******************************************************************************/
static void onoff_recall(uint16_t model_id,
                         uint16_t element_index,
                         const struct mesh_generic_state *current,
                         const struct mesh_generic_state *target,
                         uint32_t transition_ms)
{
  (void)model_id;

  log_info("Generic ON/OFF recall" NL);
  if (transition_ms == IMMEDIATE) {
    lightbulb_state.onoff_target = current->on_off.on;
  } else {
    lightbulb_state.onoff_target = target->on_off.on;
  }

  if (lightbulb_state.onoff_current == lightbulb_state.onoff_target) {
    log_info("Request for current state received; no op" NL);
  } else {
    log_info("Recall ON/OFF state <%s> with transition=%lu ms" NL,
             lightbulb_state.onoff_target ? "ON" : "OFF",
             transition_ms);

    if (transition_ms == IMMEDIATE) {
      lightbulb_state.onoff_current = current->on_off.on;
    } else {
      if (lightbulb_state.onoff_target == MESH_GENERIC_ON_OFF_STATE_ON) {
        lightbulb_state.onoff_current = MESH_GENERIC_ON_OFF_STATE_ON;
      }
      // lightbulb current state will be updated when transition is complete
      sl_status_t sc = app_timer_start(&lighting_onoff_transition_complete_timer,
                                       transition_ms,
                                       lighting_onoff_transition_complete_timer_cb,
                                       NO_CALLBACK_DATA,
                                       false);
      app_assert_status_f(sc, "Failed to start ON/OFF Transition Complete timer");
    }
    lightbulb_state_changed();
  }

  onoff_update_and_publish(element_index, transition_ms);
}

/***************************************************************************//**
 * This function is called when a light on/off request
 * with non-zero transition time has completed.
 ******************************************************************************/
static void onoff_transition_complete(void)
{
  // transition done -> set state, update and publish
  lightbulb_state.onoff_current = lightbulb_state.onoff_target;

  log_info("Transition complete. New state is %s" NL,
           lightbulb_state.onoff_current ? "ON" : "OFF");

  lightbulb_state_changed();
  onoff_update_and_publish(BTMESH_LIGHTING_SERVER_MAIN, IMMEDIATE);
}

/***************************************************************************//**
 * This function is called when delay for light on/off request has completed.
 ******************************************************************************/
static void delayed_onoff_request(void)
{
  log_info("Starting delayed ON/OFF request: %u -> %u, %lu ms" NL,
           lightbulb_state.onoff_current,
           lightbulb_state.onoff_target,
           delayed_onoff_trans);

  if (delayed_onoff_trans == 0) {
    // no transition delay, update state immediately

    lightbulb_state.onoff_current = lightbulb_state.onoff_target;
    if (lightbulb_state.onoff_current == MESH_GENERIC_ON_OFF_STATE_OFF) {
      sl_btmesh_set_state(LED_STATE_OFF);
    } else {
      // restore last brightness level
      sl_btmesh_lighting_set_level(lightbulb_state.lightness_last, IMMEDIATE);
      lightbulb_state.lightness_current = lightbulb_state.lightness_last;
    }

    lightbulb_state_changed();

    onoff_update_and_publish(BTMESH_LIGHTING_SERVER_MAIN,
                             delayed_onoff_trans);
  } else {
    if (lightbulb_state.onoff_target == MESH_GENERIC_ON_OFF_STATE_OFF) {
      lightbulb_state.lightness_target = 0;
    } else {
      // restore last brightness level, with transition delay
      lightbulb_state.lightness_target = lightbulb_state.lightness_last;
      lightbulb_state.onoff_current = MESH_GENERIC_ON_OFF_STATE_ON;

      onoff_update(BTMESH_LIGHTING_SERVER_MAIN, delayed_onoff_trans);
    }
    sl_btmesh_lighting_set_level(lightbulb_state.lightness_target,
                                 delayed_onoff_trans);

    // state is updated when transition is complete
    sl_status_t sc = app_timer_start(&lighting_onoff_transition_complete_timer,
                                     delayed_onoff_trans,
                                     lighting_onoff_transition_complete_timer_cb,
                                     NO_CALLBACK_DATA,
                                     false);
    app_assert_status_f(sc, "Failed to start ON/OFF Transition Complete timer");
  }
}

/** @} (end addtogroup GenericOnOff) */

/***************************************************************************//**
 * \defgroup GenericPowerOnOff
 * \brief Generic Power OnOff Server model.
 ******************************************************************************/

/***************************************************************************//**
 * @addtogroup GenericPowerOnOff
 * @{
 ******************************************************************************/

/***************************************************************************//**
 * Response to generic power on/off request.
 *
 * @param[in] element_index  Server model element index.
 * @param[in] client_addr    Address of the client model which sent the message.
 * @param[in] appkey_index   The application key index used in encrypting.
 *
 * @return Status of the response operation.
 *         Returns SL_STATUS_OK (0) if succeed, non-zero otherwise.
 ******************************************************************************/
static sl_status_t power_onoff_response(uint16_t element_index,
                                        uint16_t client_addr,
                                        uint16_t appkey_index)
{
  struct mesh_generic_state current;
  current.kind = mesh_generic_state_on_power_up;
  current.on_power_up.on_power_up = lightbulb_state.onpowerup;

  return generic_server_respond(MESH_GENERIC_POWER_ON_OFF_SETUP_SERVER_MODEL_ID,
                                element_index,
                                client_addr,
                                appkey_index,
                                &current,
                                NULL,
                                0,
                                0x00);
}

/***************************************************************************//**
 * Update generic power on/off state.
 *
 * @param[in] element_index  Server model element index.
 *
 * @return Status of the update operation.
 *         Returns SL_STATUS_OK (0) if succeed, non-zero otherwise.
 ******************************************************************************/
static sl_status_t power_onoff_update(uint16_t element_index)
{
  struct mesh_generic_state current;
  current.kind = mesh_generic_state_on_power_up;
  current.on_power_up.on_power_up = lightbulb_state.onpowerup;

  return generic_server_update(MESH_GENERIC_POWER_ON_OFF_SERVER_MODEL_ID,
                               element_index,
                               &current,
                               NULL,
                               0);
}

/***************************************************************************//**
 * Update generic power on/off state and publish model state to the network.
 *
 * @param[in] element_index  Server model element index.
 *
 * @return Status of the update and publish operation.
 *         Returns SL_STATUS_OK (0) if succeed, non-zero otherwise.
 ******************************************************************************/
static sl_status_t power_onoff_update_and_publish(uint16_t element_index)
{
  sl_status_t e;

  e = power_onoff_update(element_index);
  if (e == SL_STATUS_OK) {
    e = generic_server_publish(MESH_GENERIC_POWER_ON_OFF_SERVER_MODEL_ID,
                               element_index,
                               mesh_generic_state_on_power_up);
  }

  return e;
}

/***************************************************************************//**
 * This function process the requests for the generic power on/off model.
 *
 * @param[in] model_id       Server model ID.
 * @param[in] element_index  Server model element index.
 * @param[in] client_addr    Address of the client model which sent the message.
 * @param[in] server_addr    Address the message was sent to.
 * @param[in] appkey_index   The application key index used in encrypting the request.
 * @param[in] request        Pointer to the request structure.
 * @param[in] transition_ms  Requested transition time (in milliseconds).
 * @param[in] delay_ms       Delay time (in milliseconds).
 * @param[in] request_flags  Message flags. Bitmask of the following:
 *                           - Bit 0: Nonrelayed. If nonzero indicates
 *                                    a response to a nonrelayed request.
 *                           - Bit 1: Response required. If nonzero client
 *                                    expects a response from the server.
 ******************************************************************************/
static void power_onoff_request(uint16_t model_id,
                                uint16_t element_index,
                                uint16_t client_addr,
                                uint16_t server_addr,
                                uint16_t appkey_index,
                                const struct mesh_generic_request *request,
                                uint32_t transition_ms,
                                uint16_t delay_ms,
                                uint8_t request_flags)
{
  (void)model_id;
  (void)server_addr;
  (void)transition_ms;
  (void)delay_ms;

  log_info("ON POWER UP request received; state=<%s>" NL,
           lightbulb_state.onpowerup == 0 ? "OFF"
           : lightbulb_state.onpowerup == 1 ? "ON"
           : "RESTORE");

  if (lightbulb_state.onpowerup == request->on_power_up) {
    log_info("Request for current state received; no op" NL);
  } else {
    log("Setting onpowerup to <%s>" NL,
        request->on_power_up == 0 ? "OFF"
        : request->on_power_up == 1 ? "ON"
        : "RESTORE");
    lightbulb_state.onpowerup = request->on_power_up;
    lightbulb_state_changed();
  }

  if (request_flags & MESH_REQUEST_FLAG_RESPONSE_REQUIRED) {
    power_onoff_response(element_index, client_addr, appkey_index);
  }
  power_onoff_update_and_publish(element_index);
}

/***************************************************************************//**
 * This function is a handler for generic power on/off change event.
 *
 * @param[in] model_id       Server model ID.
 * @param[in] element_index  Server model element index.
 * @param[in] current        Pointer to current state structure.
 * @param[in] target         Pointer to target state structure.
 * @param[in] remaining_ms   Time (in milliseconds) remaining before transition
 *                           from current state to target state is complete.
 ******************************************************************************/
static void power_onoff_change(uint16_t model_id,
                               uint16_t element_index,
                               const struct mesh_generic_state *current,
                               const struct mesh_generic_state *target,
                               uint32_t remaining_ms)
{
  (void)model_id;
  (void)element_index;
  (void)current;
  (void)target;
  (void)remaining_ms;
  // TODO
}

