Realeed/Silabs_BTMesh/EFR32xG22_btmesh_soc_lightness_server/gecko_sdk_4.4.1/app/btmesh/common/btmesh_lighting_server/sl_btmesh_lighting_server.c
/** @} (end addtogroup GenericPowerOnOff) */

/***************************************************************************//**
 * \defgroup GenericTransitionTime
 * \brief Generic Default Transition Time Server model.
 ******************************************************************************/

/***************************************************************************//**
 * @addtogroup GenericTransitionTime
 * @{
 ******************************************************************************/

/***************************************************************************//**
 * Response to generic default transition time request.
 *
 * @param[in] element_index  Server model element index.
 * @param[in] client_addr    Address of the client model which sent the message.
 * @param[in] appkey_index   The application key index used in encrypting.
 *
 * @return Status of the response operation.
 *         Returns SL_STATUS_OK (0) if succeed, non-zero otherwise.
 ******************************************************************************/
static sl_status_t transtime_response(uint16_t element_index,
                                      uint16_t client_addr,
                                      uint16_t appkey_index)
{
  struct mesh_generic_state current;
  current.kind = mesh_generic_state_transition_time;
  current.transition_time.time = lightbulb_state.transtime;

  return generic_server_respond(MESH_GENERIC_TRANSITION_TIME_SERVER_MODEL_ID,
                                element_index,
                                client_addr,
                                appkey_index,
                                &current,
                                NULL,
                                0,
                                0x00);
}

/***************************************************************************//**
 * Update generic default transition time state.
 *
 * @param[in] element_index  Server model element index.
 *
 * @return Status of the update operation.
 *         Returns SL_STATUS_OK (0) if succeed, non-zero otherwise.
 ******************************************************************************/
static sl_status_t transtime_update(uint16_t element_index)
{
  struct mesh_generic_state current;
  current.kind = mesh_generic_state_transition_time;
  current.transition_time.time = lightbulb_state.transtime;

  return generic_server_update(MESH_GENERIC_TRANSITION_TIME_SERVER_MODEL_ID,
                               element_index,
                               &current,
                               NULL,
                               0);
}

/***************************************************************************//**
 * Update generic default transition time state and publish model state
 * to the network.
 *
 * @param[in] element_index  Server model element index.
 *
 * @return Status of the update and publish operation.
 *         Returns SL_STATUS_OK (0) if succeed, non-zero otherwise.
 ******************************************************************************/
static sl_status_t transtime_update_and_publish(uint16_t element_index)
{
  sl_status_t e;

  e = transtime_update(element_index);
  if (e == SL_STATUS_OK) {
    e = generic_server_publish(MESH_GENERIC_TRANSITION_TIME_SERVER_MODEL_ID,
                               element_index,
                               mesh_generic_state_transition_time);
  }

  return e;
}

/***************************************************************************//**
 * This function process the requests for the generic default transition time
 * model.
 *
 * @param[in] model_id       Server model ID.
 * @param[in] element_index  Server model element index.
 * @param[in] client_addr    Address of the client model which sent the message.
 * @param[in] server_addr    Address the message was sent to.
 * @param[in] appkey_index   The application key index used in encrypting the request.
 * @param[in] request        Pointer to the request structure.
 * @param[in] transition_ms  Requested transition time (in milliseconds).
 * @param[in] delay_ms       Delay time (in milliseconds).
 * @param[in] request_flags  Message flags. Bitmask of the following:
 *                           - Bit 0: Nonrelayed. If nonzero indicates
 *                                    a response to a nonrelayed request.
 *                           - Bit 1: Response required. If nonzero client
 *                                    expects a response from the server.
 ******************************************************************************/
static void transtime_request(uint16_t model_id,
                              uint16_t element_index,
                              uint16_t client_addr,
                              uint16_t server_addr,
                              uint16_t appkey_index,
                              const struct mesh_generic_request *request,
                              uint32_t transition_ms,
                              uint16_t delay_ms,
                              uint8_t request_flags)
{
  (void)model_id;
  (void)server_addr;
  (void)transition_ms;
  (void)delay_ms;

  log_info("Transition time request received; state=<0x%x>" NL,
           lightbulb_state.transtime);

  if (lightbulb_state.transtime == request->transition_time) {
    log_info("Request for current state received; no op" NL);
  } else {
    log_info("Setting transtime to <0x%x>" NL, request->transition_time);
    lightbulb_state.transtime = request->transition_time;
    lightbulb_state_changed();
  }

  if (request_flags & MESH_REQUEST_FLAG_RESPONSE_REQUIRED) {
    transtime_response(element_index, client_addr, appkey_index);
  }
  transtime_update_and_publish(element_index);
}

/***************************************************************************//**
 * This function is a handler for generic default transition time change event.
 *
 * @param[in] model_id       Server model ID.
 * @param[in] element_index  Server model element index.
 * @param[in] current        Pointer to current state structure.
 * @param[in] target         Pointer to target state structure.
 * @param[in] remaining_ms   Time (in milliseconds) remaining before transition
 *                           from current state to target state is complete.
 ******************************************************************************/
static void transtime_change(uint16_t model_id,
                             uint16_t element_index,
                             const struct mesh_generic_state *current,
                             const struct mesh_generic_state *target,
                             uint32_t remaining_ms)
{
  (void)model_id;
  (void)element_index;
  (void)current;
  (void)target;
  (void)remaining_ms;
  // TODO
}

