Realeed/Silabs_BTMesh/EFR32xG22_btmesh_soc_lightness_server/gecko_sdk_4.4.1/app/btmesh/common/btmesh_lighting_server/sl_btmesh_lighting_server.c
  uint16_t actual_request = 0;

  switch (request->kind) {
    case mesh_lighting_request_lightness_actual:
      lightness_kind = mesh_lighting_state_lightness_actual;
      actual_request = request->lightness;
      break;

    case mesh_lighting_request_lightness_linear:
      lightness_kind = mesh_lighting_state_lightness_linear;
      actual_request = linear2actual(request->lightness);
      break;

    default:
      break;
  }

  log_info("lightness_request: level=%u, transition=%lu, delay=%u" NL,
           actual_request, transition_ms, delay_ms);

  if (lightbulb_state.lightness_current == actual_request) {
    log_info("Request for current state received; no op" NL);
  } else {
    log_info("Setting lightness to <%u>" NL, actual_request);
    if (transition_ms == 0 && delay_ms == 0) { // Immediate change
      lightbulb_state.lightness_current = actual_request;
      lightbulb_state.lightness_target = actual_request;
      if (actual_request != 0) {
        lightbulb_state.lightness_last = actual_request;
      }

      // update LED PWM duty cycle
      sl_btmesh_lighting_set_level(lightbulb_state.lightness_current,
                                   IMMEDIATE);
    } else if (delay_ms > 0) {
      // a delay has been specified for the light change. Start a soft timer
      // that will trigger the change after the given delay
      // Current state remains as is for now
      lightbulb_state.lightness_target = actual_request;
      sl_status_t sc = app_timer_start(&lighting_delayed_lightness_request_timer,
                                       delay_ms,
                                       lighting_delayed_lightness_request_timer_cb,
                                       NO_CALLBACK_DATA,
                                       false);
      app_assert_status_f(sc, "Failed to start Delayed Lightness Request timer");
      // store transition parameter for later use
      delayed_lightness_trans = transition_ms;
    } else {
      // no delay but transition time has been set.
      lightbulb_state.lightness_target = actual_request;
      sl_btmesh_lighting_set_level(lightbulb_state.lightness_target,
                                   transition_ms);

      // lightbulb current state will be updated when transition is complete
      sl_status_t sc = app_timer_start(&lighting_transition_complete_timer,
                                       transition_ms,
                                       lighting_transition_complete_timer_cb,
                                       NO_CALLBACK_DATA,
                                       false);
      app_assert_status_f(sc, "Failed to start Lighting Transition Complete timer");
    }
    lightbulb_state_changed();

    // State has changed, so the current scene number is reset
    scene_server_reset_register(element_index);
  }

  uint32_t remaining_ms = delay_ms + transition_ms;
  if (request_flags & MESH_REQUEST_FLAG_RESPONSE_REQUIRED) {
    lightness_response(element_index,
                       client_addr,
                       appkey_index,
                       remaining_ms,
                       lightness_kind);
  }

  //lightness_update(element_index, remaining_ms, lightness_kind);

  // publish to bound states
//  if (lightness_kind == mesh_lighting_state_lightness_actual) {
//    generic_server_publish(MESH_LIGHTING_LIGHTNESS_SERVER_MODEL_ID,
//                           element_index,
//                           mesh_lighting_state_lightness_linear);
//  } else {
//    generic_server_publish(MESH_LIGHTING_LIGHTNESS_SERVER_MODEL_ID,
//                           element_index,
//                           mesh_lighting_state_lightness_actual);
//  }
//  generic_server_publish(MESH_GENERIC_ON_OFF_SERVER_MODEL_ID,
//                         element_index,
//                         mesh_generic_state_on_off);
//
//  generic_server_publish(MESH_GENERIC_LEVEL_SERVER_MODEL_ID,
//                         element_index,
//                         mesh_generic_state_level);

#ifdef SL_CATALOG_BTMESH_CTL_SERVER_PRESENT
  generic_server_publish(MESH_LIGHTING_CTL_SERVER_MODEL_ID,
                         element_index,
                         mesh_lighting_state_ctl);
#endif

#ifdef SL_CATALOG_BTMESH_HSL_SERVER_PRESENT
  generic_server_publish(MESH_LIGHTING_HSL_SERVER_MODEL_ID,
                         element_index,
                         mesh_lighting_state_hsl);
#endif
}

/***************************************************************************//**
 * This function is a handler for light lightness change event.
 *
 * @param[in] model_id       Server model ID.
 * @param[in] element_index  Server model element index.
 * @param[in] current        Pointer to current state structure.
 * @param[in] target         Pointer to target state structure.
 * @param[in] remaining_ms   Time (in milliseconds) remaining before transition
 *                           from current state to target state is complete.
 ******************************************************************************/
static void lightness_change(uint16_t model_id,
                             uint16_t element_index,
                             const struct mesh_generic_state *current,
                             const struct mesh_generic_state *target,
                             uint32_t remaining_ms)
{
  (void)model_id;
  (void)element_index;
  (void)target;
  (void)remaining_ms;

  if (current->kind != mesh_lighting_state_lightness_actual) {
    // if kind is not 'actual' then just report the change here, no change to light state
    log_info("lightness_change, kind %u, value %u" NL,
             current->kind,
             current->lightness.level);
    return;
  }

  if (lightbulb_state.lightness_current != current->lightness.level) {
    log_info("Lightness update: from %u to %u" NL,
             lightbulb_state.lightness_current,
             current->lightness.level);
    lightbulb_state.lightness_current = current->lightness.level;
    lightbulb_state_changed();
  } else {
    log_info("Lightness update -same value (%d)" NL,
             lightbulb_state.lightness_current);
  }
}

/***************************************************************************//**
 * This function is a handler for light lightness recall event.
 *
 * @param[in] model_id       Server model ID.
 * @param[in] element_index  Server model element index.
 * @param[in] current        Pointer to current state structure.
 * @param[in] target         Pointer to target state structure.
 * @param[in] transition_ms  Transition time (in milliseconds).
 ******************************************************************************/
static void lightness_recall(uint16_t model_id,
                             uint16_t element_index,
                             const struct mesh_generic_state *current,
                             const struct mesh_generic_state *target,
                             uint32_t transition_ms)
{
  (void)model_id;

  log_info("Light Lightness recall" NL);
  if (current->kind != mesh_lighting_state_lightness_actual) {
    return;
  }

