Realeed/Silabs_BTMesh/EFR32xG22_btmesh_soc_lightness_server/gecko_sdk_4.4.1/app/btmesh/common/btmesh_lighting_server/sl_btmesh_lighting_server.c
  if (transition_ms == IMMEDIATE) {
    lightbulb_state.lightness_target = current->lightness.level;
  } else {
    lightbulb_state.lightness_target = target->lightness.level;
  }

  if (lightbulb_state.lightness_current == lightbulb_state.lightness_target) {
    log_info("Request for current state received; no op" NL);
  } else {
    log_info("Recall lightness to %u with transition=%lu ms" NL,
             lightbulb_state.lightness_target,
             transition_ms);
    sl_btmesh_lighting_set_level(lightbulb_state.lightness_target,
                                 transition_ms);

    if (transition_ms == IMMEDIATE) {
      lightbulb_state.lightness_current = current->lightness.level;
    } else {
      // lightbulb current state will be updated when transition is complete
      sl_status_t sc = app_timer_start(&lighting_transition_complete_timer,
                                       transition_ms,
                                       lighting_transition_complete_timer_cb,
                                       NO_CALLBACK_DATA,
                                       false);
      app_assert_status_f(sc, "Failed to start Lighting Transition Complete timer");
    }
    lightbulb_state_changed();
  }

  lightness_update(element_index,
                               transition_ms,
                               mesh_lighting_state_lightness_actual);
}

/***************************************************************************//**
 * This function is called when a light lightness request
 * with non-zero transition time has completed.
 ******************************************************************************/
static void lightness_transition_complete(void)
{
  // transition done -> set state, update and publish
  lightbulb_state.lightness_current = lightbulb_state.lightness_target;
  if (lightbulb_state.lightness_target != 0) {
    lightbulb_state.lightness_last = lightbulb_state.lightness_target;
  }

  log_info("Transition complete. New level is %u" NL,
           lightbulb_state.lightness_current);

  lightbulb_state_changed();
  lightness_update(BTMESH_LIGHTING_SERVER_MAIN,
                               IMMEDIATE,
                               lightness_kind);
}

/***************************************************************************//**
 * This function is called when delay for light lightness request has completed.
 ******************************************************************************/
static void delayed_lightness_request(void)
{
  log_info("Starting delayed lightness request: level %u -> %u, %lu ms" NL,
           lightbulb_state.lightness_current,
           lightbulb_state.lightness_target,
           delayed_lightness_trans);

  sl_btmesh_lighting_set_level(lightbulb_state.lightness_target,
                               delayed_lightness_trans);

  if (delayed_lightness_trans == 0) {
    // no transition delay, update state immediately
    lightbulb_state.lightness_current = lightbulb_state.lightness_target;
    if (lightbulb_state.lightness_target != 0) {
      lightbulb_state.lightness_last = lightbulb_state.lightness_target;
    }

    lightbulb_state_changed();
    lightness_update(BTMESH_LIGHTING_SERVER_MAIN,
                                 delayed_lightness_trans,
                                 lightness_kind);
  } else {
    // state is updated when transition is complete
    sl_status_t sc = app_timer_start(&lighting_transition_complete_timer,
                                     delayed_lightness_trans,
                                     lighting_transition_complete_timer_cb,
                                     NO_CALLBACK_DATA,
                                     false);
    app_assert_status_f(sc, "Failed to start Lighting Transition Complete timer");
  }
}

/** @} (end addtogroup LightLightness) */

/***************************************************************************//**
 * \defgroup LightLightnessSetup
 * \brief Light Lightness Setup Server model.
 ******************************************************************************/

/***************************************************************************//**
 * @addtogroup LightLightnessSetup
 * @{
 ******************************************************************************/

/***************************************************************************//**
 * Response to light lightness setup request.
 *
 * @param[in] element_index  Server model element index.
 * @param[in] client_addr    Address of the client model which sent the message.
 * @param[in] appkey_index   The application key index used in encrypting.
 * @param[in] kind           Type of state used in light lightness setup response.
 *
 * @return Status of the response operation.
 *         Returns SL_STATUS_OK (0) if succeed, non-zero otherwise.
 ******************************************************************************/
static sl_status_t lightness_setup_response(uint16_t element_index,
                                            uint16_t client_addr,
                                            uint16_t appkey_index,
                                            mesh_generic_state_t kind)
{
  struct mesh_generic_state current;

  current.kind = kind;

  switch (kind) {
    case mesh_lighting_state_lightness_default:
      current.lightness.level = lightbulb_state.lightness_default;
      break;

    case mesh_lighting_state_lightness_range:
      current.lightness_range.min = lightbulb_state.lightness_min;
      current.lightness_range.max = lightbulb_state.lightness_max;
      break;

    default:
      break;
  }

  return generic_server_respond(MESH_LIGHTING_LIGHTNESS_SETUP_SERVER_MODEL_ID,
                                element_index,
                                client_addr,
                                appkey_index,
                                &current,
                                NULL,
                                0,
                                0x00);
}

/***************************************************************************//**
 * Update light lightness setup state.
 *
 * @param[in] element_index  Server model element index.
 * @param[in] kind           Type of state used in light lightness setup update.
 *
 * @return Status of the update operation.
 *         Returns SL_STATUS_OK (0) if succeed, non-zero otherwise.
 ******************************************************************************/
static sl_status_t lightness_setup_update(uint16_t element_index,
                                          mesh_generic_state_t kind)
{
  struct mesh_generic_state current;

  current.kind = kind;

  switch (kind) {
    case mesh_lighting_state_lightness_default:
      current.lightness.level = lightbulb_state.lightness_default;
      break;

