Realeed/Silabs_BTMesh/EFR32xG22_btmesh_soc_lightness_server/gecko_sdk_4.4.1/app/btmesh/common/btmesh_lighting_server/sl_btmesh_lighting_server.c
    case mesh_lighting_state_lightness_range:
      current.lightness_range.min = lightbulb_state.lightness_min;
      current.lightness_range.max = lightbulb_state.lightness_max;
      break;

    default:
      break;
  }

  return generic_server_update(MESH_LIGHTING_LIGHTNESS_SERVER_MODEL_ID,
                               element_index,
                               &current,
                               NULL,
                               0);
}

/***************************************************************************//**
 * This function process the requests for the light lightness setup model.
 *
 * @param[in] model_id       Server model ID.
 * @param[in] element_index  Server model element index.
 * @param[in] client_addr    Address of the client model which sent the message.
 * @param[in] server_addr    Address the message was sent to.
 * @param[in] appkey_index   The application key index used in encrypting the request.
 * @param[in] request        Pointer to the request structure.
 * @param[in] transition_ms  Requested transition time (in milliseconds).
 * @param[in] delay_ms       Delay time (in milliseconds).
 * @param[in] request_flags  Message flags. Bitmask of the following:
 *                           - Bit 0: Nonrelayed. If nonzero indicates
 *                                    a response to a nonrelayed request.
 *                           - Bit 1: Response required. If nonzero client
 *                                    expects a response from the server.
 ******************************************************************************/
static void lightness_setup_request(uint16_t model_id,
                                    uint16_t element_index,
                                    uint16_t client_addr,
                                    uint16_t server_addr,
                                    uint16_t appkey_index,
                                    const struct mesh_generic_request *request,
                                    uint32_t transition_ms,
                                    uint16_t delay_ms,
                                    uint8_t request_flags)
{
  (void)model_id;
  (void)server_addr;
  (void)transition_ms;
  (void)delay_ms;

  mesh_generic_state_t kind = mesh_generic_state_last;
  switch (request->kind) {
    case mesh_lighting_request_lightness_default:
      kind = mesh_lighting_state_lightness_default;
      log_info("lightness_setup_request: state=lightness_default, default_lightness=%u" NL,
               request->lightness);

      if (lightbulb_state.lightness_default == request->lightness) {
        log_info("Request for current state received; no op" NL);
      } else {
        log_info("Setting default lightness to <%u>" NL, request->lightness);
        lightbulb_state.lightness_default = request->lightness;
        lightbulb_state_changed();
      }
      break;

    case mesh_lighting_request_lightness_range:
      kind = mesh_lighting_state_lightness_range;
      log_info("lightness_setup_request: state=lightness_range, min_lightness=%u, max_lightness=%u" NL,
               request->lightness_range.min, request->lightness_range.max);

      if ((lightbulb_state.lightness_min == request->lightness_range.min)
          && (lightbulb_state.lightness_max == request->lightness_range.max)) {
        log_info("Request for current state received; no op" NL);
      } else {
        if (lightbulb_state.lightness_min != request->lightness_range.min) {
          log_info("Setting min lightness to <%u>" NL,
                   request->lightness_range.min);
          lightbulb_state.lightness_min = request->lightness_range.min;
          if (lightbulb_state.lightness_current < request->lightness_range.min
              && lightbulb_state.lightness_current != 0) {
            lightbulb_state.lightness_current = request->lightness_range.min;
            sl_btmesh_lighting_set_level(lightbulb_state.lightness_current,
                                         IMMEDIATE);
          }
        }
        if (lightbulb_state.lightness_max != request->lightness_range.max) {
          log_info("Setting max lightness to <%u>" NL,
                   request->lightness_range.max);
          lightbulb_state.lightness_max = request->lightness_range.max;
          if (lightbulb_state.lightness_current > request->lightness_range.max) {
            lightbulb_state.lightness_current = request->lightness_range.max;
            sl_btmesh_lighting_set_level(lightbulb_state.lightness_current,
                                         IMMEDIATE);
          }
        }
        lightbulb_state_changed();
      }
      break;

    default:
      break;
  }

  if (request_flags & MESH_REQUEST_FLAG_RESPONSE_REQUIRED) {
    lightness_setup_response(element_index, client_addr, appkey_index, kind);
  } else {
    lightness_setup_update(element_index, kind);
  }
}

/***************************************************************************//**
 * This function is a handler for light lightness setup change event.
 *
 * @param[in] model_id       Server model ID.
 * @param[in] element_index  Server model element index.
 * @param[in] current        Pointer to current state structure.
 * @param[in] target         Pointer to target state structure.
 * @param[in] remaining_ms   Time (in milliseconds) remaining before transition
 *                           from current state to target state is complete.
 ******************************************************************************/
static void lightness_setup_change(uint16_t model_id,
                                   uint16_t element_index,
                                   const struct mesh_generic_state *current,
                                   const struct mesh_generic_state *target,
                                   uint32_t remaining_ms)
{
  (void)model_id;
  (void)element_index;
  (void)target;
  (void)remaining_ms;

  switch (current->kind) {
    case mesh_lighting_state_lightness_default:
      if (lightbulb_state.lightness_default != current->lightness.level) {
        log_info("Default lightness update: from %u to %u" NL,
                 lightbulb_state.lightness_default,
                 current->lightness.level);
        lightbulb_state.lightness_default = current->lightness.level;
        lightbulb_state_changed();
      } else {
        log_info("Default lightness update -same value (%u)" NL,
                 lightbulb_state.lightness_default);
      }
      break;

