Realeed/Silabs_BTMesh/EFR32xG22_btmesh_soc_lightness_server/gecko_sdk_4.4.1/app/btmesh/common/btmesh_lighting_server/sl_btmesh_lighting_server.c
    case mesh_lighting_state_lightness_range:
      if (lightbulb_state.lightness_min != current->lightness_range.min) {
        log_info("Min lightness update: from %u to %u" NL,
                 lightbulb_state.lightness_min,
                 current->lightness_range.min);
        lightbulb_state.lightness_min = current->lightness_range.min;
        lightbulb_state_changed();
      } else {
        log_info("Min lightness update -same value (%u)" NL,
                 lightbulb_state.lightness_min);
      }

      if (lightbulb_state.lightness_max != current->lightness_range.max) {
        log_info("Max lightness update: from %u to %u" NL,
                 lightbulb_state.lightness_max,
                 current->lightness_range.max);
        lightbulb_state.lightness_max = current->lightness_range.max;
        lightbulb_state_changed();
      } else {
        log_info("Max lightness update -same value (%u)" NL,
                 lightbulb_state.lightness_max);
      }

      break;

    default:
      break;
  }
}

/** @} (end addtogroup LightLightnessSetup) */

/***************************************************************************//**
 * \defgroup PriGenericLevel
 * \brief Generic Level Server model on primary element.
 ******************************************************************************/

/***************************************************************************//**
 * @addtogroup PriGenericLevel
 * @{
 ******************************************************************************/

/***************************************************************************//**
 * Response to generic level request on primary element.
 *
 * @param[in] element_index  Server model element index.
 * @param[in] client_addr    Address of the client model which sent the message.
 * @param[in] appkey_index   The application key index used in encrypting.
 * @param[in] remaining_ms   The remaining time in milliseconds.
 *
 * @return Status of the response operation.
 *         Returns SL_STATUS_OK (0) if succeed, non-zero otherwise.
 ******************************************************************************/
static sl_status_t pri_level_response(uint16_t element_index,
                                      uint16_t client_addr,
                                      uint16_t appkey_index,
                                      uint32_t remaining_ms)
{
  struct mesh_generic_state current, target;

  current.kind = mesh_generic_state_level;
  current.level.level = lightbulb_state.pri_level_current;

  target.kind = mesh_generic_state_level;
  target.level.level = lightbulb_state.pri_level_target;

  return generic_server_respond(MESH_GENERIC_LEVEL_SERVER_MODEL_ID,
                                element_index,
                                client_addr,
                                appkey_index,
                                &current,
                                &target,
                                remaining_ms,
                                0x00);
}

/***************************************************************************//**
 * Update generic level state on primary element.
 *
 * @param[in] element_index  Server model element index.
 * @param[in] remaining_ms   The remaining time in milliseconds.
 *
 * @return Status of the update operation.
 *         Returns SL_STATUS_OK (0) if succeed, non-zero otherwise.
 ******************************************************************************/
static sl_status_t pri_level_update(uint16_t element_index,
                                    uint32_t remaining_ms)
{
  struct mesh_generic_state current, target;

  current.kind = mesh_generic_state_level;
  current.level.level = lightbulb_state.pri_level_current;

  target.kind = mesh_generic_state_level;
  target.level.level = lightbulb_state.pri_level_target;

  return generic_server_update(MESH_GENERIC_LEVEL_SERVER_MODEL_ID,
                               element_index,
                               &current,
                               &target,
                               remaining_ms);
}

/***************************************************************************//**
 * Update generic level state on primary element
 * and publish model state to the network.
 *
 * @param[in] element_index  Server model element index.
 * @param[in] remaining_ms   The remaining time in milliseconds.
 *
 * @return Status of the update and publish operation.
 *         Returns SL_STATUS_OK (0) if succeed, non-zero otherwise.
 ******************************************************************************/
static sl_status_t pri_level_update_and_publish(uint16_t element_index,
                                                uint32_t remaining_ms)
{
  sl_status_t e;

  e = pri_level_update(element_index, remaining_ms);
  if (e == SL_STATUS_OK) {
    e = generic_server_publish(MESH_GENERIC_LEVEL_SERVER_MODEL_ID,
                               element_index,
                               mesh_generic_state_level);
  }

  return e;
}

/***************************************************************************//**
 * Schedule next generic level move request on primary element.
 *
 * @param[in] remaining_delta   The remaining level delta to the target state.
 ******************************************************************************/
static void pri_level_move_schedule_next_request(int32_t remaining_delta)
{
  uint32_t transition_ms = 0;
  if (abs(remaining_delta) < abs(move_pri_level_delta)) {
    transition_ms = (uint32_t)(((int64_t)move_pri_level_trans * remaining_delta)
                               / move_pri_level_delta);
    sl_btmesh_lighting_set_level(lightbulb_state.lightness_target,
                                 transition_ms);
  } else {
    transition_ms = move_pri_level_trans;
    sl_btmesh_lighting_set_level(lightbulb_state.lightness_current
                                 + move_pri_level_delta,
                                 move_pri_level_trans);
  }
  sl_status_t sc = app_timer_start(&lighting_pri_level_move_timer,
                                   transition_ms,
                                   lighting_pri_level_move_timer_cb,
                                   NO_CALLBACK_DATA,
                                   false);
  app_assert_status_f(sc, "Failed to start Pri Level timer");
}

/***************************************************************************//**
 * Handle generic level move request on primary element.
 ******************************************************************************/
static void pri_level_move_request(void)
{
  log_info("Primary level move: level %d -> %d, delta %d in %lu ms" NL,
           lightbulb_state.pri_level_current,
           lightbulb_state.pri_level_target,
           move_pri_level_delta,
           move_pri_level_trans);

