Realeed/Silabs_BTMesh/EFR32xG22_btmesh_soc_lightness_server/gecko_sdk_4.4.1/app/btmesh/common/btmesh_lighting_server/sl_btmesh_lighting_server.c
  int32_t remaining_delta = (int32_t)lightbulb_state.pri_level_target
                            - lightbulb_state.pri_level_current;

  if (abs(remaining_delta) < abs(move_pri_level_delta)) {
    // end of move level as it reached target state
    lightbulb_state.pri_level_current = lightbulb_state.pri_level_target;
    lightbulb_state.lightness_current = lightbulb_state.lightness_target;
  } else {
    lightbulb_state.pri_level_current += move_pri_level_delta;
    lightbulb_state.lightness_current += move_pri_level_delta;
  }
  lightbulb_state_changed();
  pri_level_update_and_publish(BTMESH_LIGHTING_SERVER_MAIN,
                               UNKNOWN_REMAINING_TIME);

  remaining_delta = (int32_t)lightbulb_state.pri_level_target
                    - lightbulb_state.pri_level_current;
  if (remaining_delta != 0) {
    pri_level_move_schedule_next_request(remaining_delta);
  }
}

/***************************************************************************//**
 * Stop generic level move on primary element.
 ******************************************************************************/
static void pri_level_move_stop(void)
{
  // Cancel timers
  sl_status_t sc = app_timer_stop(&lighting_delayed_pri_level_timer);
  app_assert_status_f(sc, "Failed to stop Delayed Primary Level timer");
  sc = app_timer_stop(&lighting_pri_level_move_timer);
  app_assert_status_f(sc, "Failed to stop Primary Level Move timer");
  //Reset move parameters
  move_pri_level_delta = 0;
  move_pri_level_trans = 0;
}

/***************************************************************************//**
 * This function process the requests for the generic level model
 * on primary element.
 *
 * @param[in] model_id       Server model ID.
 * @param[in] element_index  Server model element index.
 * @param[in] client_addr    Address of the client model which sent the message.
 * @param[in] server_addr    Address the message was sent to.
 * @param[in] appkey_index   The application key index used in encrypting the request.
 * @param[in] request        Pointer to the request structure.
 * @param[in] transition_ms  Requested transition time (in milliseconds).
 * @param[in] delay_ms       Delay time (in milliseconds).
 * @param[in] request_flags  Message flags. Bitmask of the following:
 *                           - Bit 0: Nonrelayed. If nonzero indicates
 *                                    a response to a nonrelayed request.
 *                           - Bit 1: Response required. If nonzero client
 *                                    expects a response from the server.
 ******************************************************************************/
static void pri_level_request(uint16_t model_id,
                              uint16_t element_index,
                              uint16_t client_addr,
                              uint16_t server_addr,
                              uint16_t appkey_index,
                              const struct mesh_generic_request *request,
                              uint32_t transition_ms,
                              uint16_t delay_ms,
                              uint8_t request_flags)
{
  (void)model_id;
  (void)server_addr;

  uint16_t lightness;
  uint32_t remaining_ms = UNKNOWN_REMAINING_TIME;

  switch (request->kind) {
    case mesh_generic_request_level:
      log_info("pri_level_request (generic): level=%d, transition=%lu, delay=%u" NL,
               request->level, transition_ms, delay_ms);

      pri_level_move_stop();

      if (lightbulb_state.pri_level_current == request->level) {
        log_info("Request for current state received; no op" NL);
        lightbulb_state.pri_level_target = request->level;
      } else {
        log_info("Setting pri_level to <%d>" NL, request->level);

        lightness = request->level + GENERIC_TO_LIGHTNESS_LEVEL_SHIFT;
        if (!lightness) {
          lightness = SL_BTMESH_LIGHTING_SERVER_LIGHTNESS_MIN_CFG_VAL;
        }
        if (transition_ms == 0 && delay_ms == 0) { // Immediate change
          lightbulb_state.pri_level_current = lightness - GENERIC_TO_LIGHTNESS_LEVEL_SHIFT;
          lightbulb_state.pri_level_target = lightbulb_state.pri_level_current;
          lightbulb_state.lightness_current = lightness;
          lightbulb_state.lightness_target = lightness;
          if (lightness != 0) {
            lightbulb_state.lightness_last = lightness;
          }

          // update LED Level
          sl_btmesh_lighting_set_level(lightbulb_state.lightness_target, IMMEDIATE);
        } else if (delay_ms > 0) {
          // a delay has been specified for the change. Start a soft timer
          // that will trigger the change after the given delay
          // Current state remains as is for now
          lightbulb_state.pri_level_target = request->level;
          lightbulb_state.lightness_target = lightness;
          pri_level_request_kind = mesh_generic_request_level;
          sl_status_t sc = app_timer_start(&lighting_delayed_pri_level_timer,
                                           delay_ms,
                                           lighting_delayed_pri_level_timer_cb,
                                           NO_CALLBACK_DATA,
                                           false);
          app_assert_status_f(sc, "Failed to start Delayed Primary Level timer");

          // store transition parameter for later use
          delayed_pri_level_trans = transition_ms;
        } else {
          // no delay but transition time has been set.
          lightbulb_state.pri_level_target = lightness - GENERIC_TO_LIGHTNESS_LEVEL_SHIFT;
          lightbulb_state.lightness_target = lightness;
          sl_btmesh_lighting_set_level(lightbulb_state.lightness_target, transition_ms);

          // lightbulb current state will be updated when transition is complete
          sl_status_t sc = app_timer_start(&lighting_level_transition_complete_timer,
                                           transition_ms,
                                           lighting_level_transition_complete_timer_cb,
                                           NO_CALLBACK_DATA,
                                           false);
          app_assert_status_f(sc, "Failed to start Primary Level Transition Complete timer");
        }

        // State has changed, so the current scene number is reset
        scene_server_reset_register(element_index);
      }

