Realeed/Silabs_BTMesh/EFR32xG22_btmesh_soc_lightness_server/gecko_sdk_4.4.1/app/btmesh/common/btmesh_lighting_server/sl_btmesh_lighting_server.c
      remaining_ms = delay_ms + transition_ms;
      break;

    case mesh_generic_request_level_move: {
      log_info("pri_level_request (move): delta=%d, transition=%lu, delay=%u" NL,
               request->level, transition_ms, delay_ms);
      // Store move parameters
      move_pri_level_delta = request->level;
      move_pri_level_trans = transition_ms;

      int16_t requested_level = 0;
      if (move_pri_level_delta > 0) {
        requested_level = 0x7FFF; // Max level value
      } else if (move_pri_level_delta < 0) {
        requested_level = 0x8000; // Min level value
      }

      if (lightbulb_state.pri_level_current == requested_level) {
        log_info("Request for current state received; no op" NL);
        lightbulb_state.pri_level_target = requested_level;
        remaining_ms = IMMEDIATE;
      } else {
        log_info("Setting pri_level to <%d>" NL, requested_level);

        lightness = requested_level + GENERIC_TO_LIGHTNESS_LEVEL_SHIFT;

        if (delay_ms > 0) {
          // a delay has been specified for the move. Start a soft timer
          // that will trigger the move after the given delay
          // Current state remains as is for now
          lightbulb_state.pri_level_target = requested_level;
          lightbulb_state.lightness_target = lightness;
          pri_level_request_kind = mesh_generic_request_level_move;
          sl_status_t sc = app_timer_start(&lighting_delayed_pri_level_timer,
                                           delay_ms,
                                           lighting_delayed_pri_level_timer_cb,
                                           NO_CALLBACK_DATA,
                                           false);
          app_assert_status_f(sc, "Failed to start Delayed Primary Level timer");
        } else {
          // no delay so start move
          lightbulb_state.pri_level_target = requested_level;
          lightbulb_state.lightness_target = lightness;

          int32_t remaining_delta = (int32_t)lightbulb_state.pri_level_target
                                    - lightbulb_state.pri_level_current;
          pri_level_move_schedule_next_request(remaining_delta);
        }
        remaining_ms = UNKNOWN_REMAINING_TIME;

        // State has changed, so the current scene number is reset
        scene_server_reset_register(element_index);
      }
      break;
    }

    case mesh_generic_request_level_halt:
      log_info("pri_level_request (halt)" NL);

      // Set current state
      lightbulb_state.lightness_current = sl_btmesh_get_level();
      lightbulb_state.lightness_target = lightbulb_state.lightness_current;
      lightbulb_state.pri_level_current = lightbulb_state.lightness_current
                                          - GENERIC_TO_LIGHTNESS_LEVEL_SHIFT;
      lightbulb_state.pri_level_target = lightbulb_state.pri_level_current;
      if (delay_ms > 0) {
        // a delay has been specified for the move halt. Start a soft timer
        // that will trigger the move halt after the given delay
        // Current state remains as is for now
        remaining_ms = delay_ms;
        pri_level_request_kind = mesh_generic_request_level_halt;
        sl_status_t sc = app_timer_start(&lighting_delayed_pri_level_timer,
                                         delay_ms,
                                         lighting_delayed_pri_level_timer_cb,
                                         NO_CALLBACK_DATA,
                                         false);
        app_assert_status_f(sc, "Failed to start Delayed Primary Level timer");
      } else {
        pri_level_move_stop();
        sl_btmesh_lighting_set_level(lightbulb_state.lightness_current,
                                     IMMEDIATE);
        remaining_ms = IMMEDIATE;
      }
      break;

    default:
      break;
  }

  lightbulb_state_changed();

  if (request_flags & MESH_REQUEST_FLAG_RESPONSE_REQUIRED) {
    pri_level_response(element_index, client_addr, appkey_index, remaining_ms);
  }
  pri_level_update_and_publish(element_index, remaining_ms);

  // publish to bound states
  generic_server_publish(MESH_LIGHTING_LIGHTNESS_SERVER_MODEL_ID,
                         element_index,
                         mesh_lighting_state_lightness_actual);
}

/***************************************************************************//**
 * This function is a handler for generic level change event
 * on primary element.
 *
 * @param[in] model_id       Server model ID.
 * @param[in] element_index  Server model element index.
 * @param[in] current        Pointer to current state structure.
 * @param[in] target         Pointer to target state structure.
 * @param[in] remaining_ms   Time (in milliseconds) remaining before transition
 *                           from current state to target state is complete.
 ******************************************************************************/
static void pri_level_change(uint16_t model_id,
                             uint16_t element_index,
                             const struct mesh_generic_state *current,
                             const struct mesh_generic_state *target,
                             uint32_t remaining_ms)
{
  (void)model_id;
  (void)element_index;
  (void)target;
  (void)remaining_ms;

  if (lightbulb_state.pri_level_current != current->level.level) {
    log_info("Primary level update: from %d to %d" NL,
             lightbulb_state.pri_level_current,
             current->level.level);
    lightbulb_state.pri_level_current = current->level.level;
    lightbulb_state_changed();
    pri_level_move_stop();
  } else {
    log_info("Primary level update -same value (%d)" NL,
             lightbulb_state.pri_level_current);
  }
}

/***************************************************************************//**
 * This function is a handler for generic level recall event on primary element.
 *
 * @param[in] model_id       Server model ID.
 * @param[in] element_index  Server model element index.
 * @param[in] current        Pointer to current state structure.
 * @param[in] target         Pointer to target state structure.
 * @param[in] transition_ms  Transition time (in milliseconds).
 ******************************************************************************/
static void pri_level_recall(uint16_t model_id,
                             uint16_t element_index,
                             const struct mesh_generic_state *current,
                             const struct mesh_generic_state *target,
                             uint32_t transition_ms)
{
  (void)model_id;

  log_info("Primary Generic Level recall" NL);
  if (transition_ms == IMMEDIATE) {
    lightbulb_state.pri_level_target = current->level.level;
  } else {
    lightbulb_state.pri_level_target = target->level.level;
  }

  if (lightbulb_state.pri_level_current == lightbulb_state.pri_level_target) {
    log_info("Request for current state received; no op" NL);
  } else {
    log_info("Recall pri_level to %d with transition=%lu ms" NL,
             lightbulb_state.pri_level_target,
             transition_ms);
    if (transition_ms == IMMEDIATE) {
      lightbulb_state.pri_level_current = current->level.level;
    } else {
      // lightbulb current state will be updated when transition is complete
      sl_status_t sc = app_timer_start(&lighting_level_transition_complete_timer,
                                       transition_ms,
                                       lighting_level_transition_complete_timer_cb,
                                       NO_CALLBACK_DATA,
                                       false);
      app_assert_status_f(sc, "Failed to start Primary Level Transition Complete timer");
    }
    lightbulb_state_changed();
  }

  pri_level_update_and_publish(element_index, transition_ms);
}

/***************************************************************************//**
 * This function is called when a generic level request on primary element
 * with non-zero transition time has completed.
 ******************************************************************************/
static void pri_level_transition_complete(void)
{
  // transition done -> set state, update and publish
  lightbulb_state.pri_level_current = lightbulb_state.pri_level_target;
  lightbulb_state.lightness_current = lightbulb_state.lightness_target;

