Realeed/Silabs_BTMesh/EFR32xG22_btmesh_soc_lightness_server/gecko_sdk_4.4.1/app/btmesh/common/btmesh_lighting_server/sl_btmesh_lighting_server.c
  if (lightbulb_state.lightness_target != 0) {
    lightbulb_state.lightness_last = lightbulb_state.lightness_target;
  }

  log_info("Transition complete. New pri_level is %d" NL,
           lightbulb_state.pri_level_current);

  lightbulb_state_changed();
  pri_level_update_and_publish(BTMESH_LIGHTING_SERVER_MAIN, IMMEDIATE);
}

/***************************************************************************//**
 * This function is called when delay for generic level request
 * on primary element has completed.
 ******************************************************************************/
static void delayed_pri_level_request(void)
{
  log_info("Starting delayed primary level request: level %d -> %d, %lu ms" NL,
           lightbulb_state.pri_level_current,
           lightbulb_state.pri_level_target,
           delayed_pri_level_trans);

  switch (pri_level_request_kind) {
    case mesh_generic_request_level:
      sl_btmesh_lighting_set_level(lightbulb_state.lightness_target,
                                   delayed_pri_level_trans);

      if (delayed_pri_level_trans == 0) {
        // no transition delay, update state immediately
        lightbulb_state.pri_level_current = lightbulb_state.pri_level_target;
        lightbulb_state.lightness_current = lightbulb_state.lightness_target;

        if (lightbulb_state.lightness_target != 0) {
          lightbulb_state.lightness_last = lightbulb_state.lightness_target;
        }

        lightbulb_state_changed();
        pri_level_update_and_publish(BTMESH_LIGHTING_SERVER_MAIN,
                                     delayed_pri_level_trans);
      } else {
        // state is updated when transition is complete
        sl_status_t sc = app_timer_start(&lighting_level_transition_complete_timer,
                                         delayed_pri_level_trans,
                                         lighting_level_transition_complete_timer_cb,
                                         NO_CALLBACK_DATA,
                                         false);
        app_assert_status_f(sc, "Failed to start Primary Level Transition Complete timer");
      }
      break;

    case mesh_generic_request_level_move:
      pri_level_move_schedule_next_request((int32_t)lightbulb_state.pri_level_target
                                           - lightbulb_state.pri_level_current);
      pri_level_update_and_publish(BTMESH_LIGHTING_SERVER_MAIN,
                                   UNKNOWN_REMAINING_TIME);
      break;

    case mesh_generic_request_level_halt:
      // Set current state
      lightbulb_state.lightness_current = sl_btmesh_get_level();
      lightbulb_state.lightness_target = lightbulb_state.lightness_current;
      lightbulb_state.pri_level_current = lightbulb_state.lightness_current
                                          - GENERIC_TO_LIGHTNESS_LEVEL_SHIFT;
      lightbulb_state.pri_level_target = lightbulb_state.pri_level_current;
      pri_level_move_stop();
      sl_btmesh_lighting_set_level(lightbulb_state.lightness_current,
                                   IMMEDIATE);
      pri_level_update_and_publish(BTMESH_LIGHTING_SERVER_MAIN, IMMEDIATE);
      break;

    default:
      break;
  }
}

/** @} (end addtogroup PriGenericLevel) */

/***************************************************************************//**
 * Initialization of the models supported by this node.
 * This function registers callbacks for each of the supported models.
 ******************************************************************************/
static void init_models(void)
{
  generic_server_register_handler(MESH_GENERIC_ON_OFF_SERVER_MODEL_ID,
                                  BTMESH_LIGHTING_SERVER_MAIN,
                                  onoff_request,
                                  onoff_change,
                                  onoff_recall);

  generic_server_register_handler(MESH_GENERIC_POWER_ON_OFF_SETUP_SERVER_MODEL_ID,
                                  BTMESH_LIGHTING_SERVER_MAIN,
                                  power_onoff_request,
                                  power_onoff_change,
                                  NULL);

  generic_server_register_handler(MESH_GENERIC_TRANSITION_TIME_SERVER_MODEL_ID,
                                  BTMESH_LIGHTING_SERVER_MAIN,
                                  transtime_request,
                                  transtime_change,
                                  NULL);

  generic_server_register_handler(MESH_LIGHTING_LIGHTNESS_SERVER_MODEL_ID,
                                  BTMESH_LIGHTING_SERVER_MAIN,
                                  lightness_request,
                                  lightness_change,
                                  lightness_recall);

  generic_server_register_handler(MESH_LIGHTING_LIGHTNESS_SETUP_SERVER_MODEL_ID,
                                  BTMESH_LIGHTING_SERVER_MAIN,
                                  lightness_setup_request,
                                  lightness_setup_change,
                                  NULL);

  generic_server_register_handler(MESH_GENERIC_LEVEL_SERVER_MODEL_ID,
                                  BTMESH_LIGHTING_SERVER_MAIN,
                                  pri_level_request,
                                  pri_level_change,
                                  pri_level_recall);
}

/***************************************************************************//**
 * This function loads the saved light state from Persistent Storage and
 * copies the data in the global variable lightbulb_state.
 * If PS key with ID SL_BTMESH_LIGHTING_SERVER_PS_KEY_CFG_VAL does not exist or loading failed,
 * lightbulb_state is set to zero and some default values are written to it.
 *
 * @return Returns SL_STATUS_OK (0) if succeed, non-zero otherwise.
 ******************************************************************************/
static sl_status_t lightbulb_state_load(void)
{
  sl_status_t sc;
  size_t ps_len = 0;
  struct lightbulb_state ps_data;

  sc = sl_bt_nvm_load(SL_BTMESH_LIGHTING_SERVER_PS_KEY_CFG_VAL,
                      sizeof(ps_data),
                      &ps_len,
                      (uint8_t *)&ps_data);

  // Set default values if ps_load fail or size of lightbulb_state has changed
  if ((sc != SL_STATUS_OK) || (ps_len != sizeof(struct lightbulb_state))) {
    memset(&lightbulb_state, 0, sizeof(struct lightbulb_state));
    lightbulb_state.lightness_last    = LIGHTNESS_LAST_DEFAULT;
    lightbulb_state.lightness_default = LIGHTNESS_DEFAULT_DEFAULT;
    lightbulb_state.lightness_min     = SL_BTMESH_LIGHTING_SERVER_LIGHTNESS_MIN_CFG_VAL;
    lightbulb_state.lightness_max     = SL_BTMESH_LIGHTING_SERVER_LIGHTNESS_MAX_CFG_VAL;

    // Check if default values are valid and correct them if needed
    lightbulb_state_validate_and_correct();

    if (sc == SL_STATUS_OK) {
      // The sl_bt_nvm_load call was successful but the size of the loaded data
      // differs from the expected size therefore error code shall be set
      sc = SL_STATUS_INVALID_STATE;
      log_error("Lighting server lightbulb state loaded from PS with invalid size, "
                "use defaults. (expected=%zd,actual=%zd)" NL,
                sizeof(struct lightbulb_state),
                ps_len);
    } else {
      log_status_error_f(sc,
                         "Lighting server lightbulb state load from PS failed "
                         "or nvm is empty, use defaults." NL);
    }
  } else {
    memcpy(&lightbulb_state, &ps_data, ps_len);
  }

  return sc;
}

/***************************************************************************//**
 * This function validates the lighbulb_state and change it if it is against
 * the specification.
 ******************************************************************************/
static void lightbulb_state_validate_and_correct(void)
{
  if (lightbulb_state.lightness_min > lightbulb_state.lightness_max) {
    lightbulb_state.lightness_min = lightbulb_state.lightness_max;
  }
  if (lightbulb_state.lightness_default) {
    if (lightbulb_state.lightness_default < lightbulb_state.lightness_min) {
      lightbulb_state.lightness_default = lightbulb_state.lightness_min;
    }
    if (lightbulb_state.lightness_default > lightbulb_state.lightness_max) {
      lightbulb_state.lightness_default = lightbulb_state.lightness_max;
    }
  }
  if (lightbulb_state.lightness_current < lightbulb_state.lightness_min) {
    lightbulb_state.lightness_current = lightbulb_state.lightness_min;
  }
  if (lightbulb_state.lightness_current > lightbulb_state.lightness_max) {
    lightbulb_state.lightness_current = lightbulb_state.lightness_max;
  }
  if (lightbulb_state.lightness_target < lightbulb_state.lightness_min) {
    lightbulb_state.lightness_target = lightbulb_state.lightness_min;
  }
  if (lightbulb_state.lightness_target > lightbulb_state.lightness_max) {
    lightbulb_state.lightness_target = lightbulb_state.lightness_max;
  }
}

/***************************************************************************//**
 * This function saves the current light state in Persistent Storage so that
 * the data is preserved over reboots and power cycles.
 * The light state is hold in a global variable lightbulb_state.
 * A PS key with ID SL_BTMESH_LIGHTING_SERVER_PS_KEY_CFG_VAL is used to store the whole struct.
 *
 * @return Returns SL_STATUS_OK (0) if succeed, non-zero otherwise.
 ******************************************************************************/
static sl_status_t lightbulb_state_store(void)
{
  sl_status_t sc;

