Realeed/Silabs_BTMesh/EFR32xG22_btmesh_soc_lightness_server/gecko_sdk_4.4.1/app/btmesh/common/btmesh_lighting_server/sl_btmesh_lighting_server.c
  sc = sl_bt_nvm_save(SL_BTMESH_LIGHTING_SERVER_PS_KEY_CFG_VAL,
                      sizeof(struct lightbulb_state),
                      (const uint8_t*)&lightbulb_state);

  log_status_error_f(sc,
                     "Lighting server lightbulb state store in PS failed." NL);

  return sc;
}

/***************************************************************************//**
 * This function is called each time the lightbulb state in RAM is changed.
 * It sets up a soft timer that will save the state in flash after small delay.
 * The purpose is to reduce amount of unnecessary flash writes.
 ******************************************************************************/
static void lightbulb_state_changed(void)
{
  sl_status_t sc = app_timer_start(&lighting_state_store_timer,
                                   SL_BTMESH_LIGHTING_SERVER_NVM_SAVE_TIME_CFG_VAL,
                                   lighting_state_store_timer_cb,
                                   NO_CALLBACK_DATA,
                                   false);
  app_assert_status_f(sc, "Failed to start State Store timer");
}

/*******************************************************************************
 * Lightbulb state initialization.
 * This is called at each boot if provisioning is already done.
 * Otherwise this function is called after provisioning is completed.
 ******************************************************************************/
void sl_btmesh_lighting_server_init(void)
{
  memset(&lightbulb_state, 0, sizeof(struct lightbulb_state));

  lightbulb_state_load();

  // Handle on power up behavior
  uint32_t transition_ms = sl_btmesh_get_default_transition_time();
  switch (lightbulb_state.onpowerup) {
    case MESH_GENERIC_ON_POWER_UP_STATE_OFF:
      log_info("On power up state is OFF" NL);
      lightbulb_state.onoff_current = MESH_GENERIC_ON_OFF_STATE_OFF;
      lightbulb_state.onoff_target = MESH_GENERIC_ON_OFF_STATE_OFF;
      lightbulb_state.lightness_current = 0;
      lightbulb_state.lightness_target = 0;
      sl_btmesh_set_state(LED_STATE_OFF);
      break;

    case MESH_GENERIC_ON_POWER_UP_STATE_ON:
      log_info("On power up state is ON" NL);
      lightbulb_state.onoff_current = MESH_GENERIC_ON_OFF_STATE_ON;
      lightbulb_state.onoff_target = MESH_GENERIC_ON_OFF_STATE_ON;
      if (lightbulb_state.lightness_default == 0) {
        lightbulb_state.lightness_current = lightbulb_state.lightness_last;
        lightbulb_state.lightness_target = lightbulb_state.lightness_last;
      } else {
        lightbulb_state.lightness_current = lightbulb_state.lightness_default;
        lightbulb_state.lightness_target = lightbulb_state.lightness_default;
      }
      if (transition_ms > 0) {
        lightbulb_state.lightness_current = 0;
        sl_btmesh_lighting_set_level(lightbulb_state.lightness_current,
                                     IMMEDIATE);
        sl_status_t sc =
          app_timer_start(&lighting_transition_complete_timer,
                          transition_ms,
                          lighting_transition_complete_timer_cb,
                          NO_CALLBACK_DATA,
                          false);
        app_assert_status_f(sc, "Failed to start Lighting Transition Complete timer");
        sl_btmesh_lighting_set_level(lightbulb_state.lightness_target,
                                     transition_ms);
      } else {
        sl_btmesh_lighting_set_level(lightbulb_state.lightness_target,
                                     IMMEDIATE);
      }
      break;

    case MESH_GENERIC_ON_POWER_UP_STATE_RESTORE:
      log_info("On power up state is RESTORE" NL);
#ifdef SL_CATALOG_BTMESH_LC_SERVER_PRESENT
      if (lc_get_mode() == 0)
#endif
      {
        if (transition_ms > 0 && lightbulb_state.lightness_target > 0) {
          lightbulb_state.lightness_current = 0;
          sl_btmesh_lighting_set_level(lightbulb_state.lightness_current,
                                       IMMEDIATE);
          sl_status_t sc =
            app_timer_start(&lighting_transition_complete_timer,
                            transition_ms,
                            lighting_transition_complete_timer_cb,
                            NO_CALLBACK_DATA,
                            false);
          app_assert_status_f(sc, "Failed to start Lighting Transition Complete timer");
          sl_btmesh_lighting_set_level(lightbulb_state.lightness_target,
                                       transition_ms);
        } else {
          lightbulb_state.lightness_current = lightbulb_state.lightness_target;
          sl_btmesh_lighting_set_level(lightbulb_state.lightness_current,
                                       IMMEDIATE);
        }

        if (lightbulb_state.lightness_current) {
          lightbulb_state.onoff_current = MESH_GENERIC_ON_OFF_STATE_ON;
        } else {
          lightbulb_state.onoff_current = MESH_GENERIC_ON_OFF_STATE_OFF;
        }

        if (lightbulb_state.lightness_target) {
          lightbulb_state.onoff_target = MESH_GENERIC_ON_OFF_STATE_ON;
        } else {
          lightbulb_state.onoff_target = MESH_GENERIC_ON_OFF_STATE_OFF;
        }
      }

      break;

    default:
      break;
  }

  lightbulb_state_changed();
  init_models();
  transtime_update(BTMESH_LIGHTING_SERVER_MAIN);
  lightness_setup_update(BTMESH_LIGHTING_SERVER_MAIN,
                         mesh_lighting_state_lightness_default);

  lightness_setup_update(BTMESH_LIGHTING_SERVER_MAIN,
                         mesh_lighting_state_lightness_range);

  power_onoff_update_and_publish(BTMESH_LIGHTING_SERVER_MAIN);

#ifdef SL_CATALOG_BTMESH_LC_PRESENT
  if (lc_get_mode() == 0)
#endif
  {
    onoff_update_and_publish(BTMESH_LIGHTING_SERVER_MAIN,
                             IMMEDIATE);

    lightness_update(BTMESH_LIGHTING_SERVER_MAIN,
                                 IMMEDIATE,
                                 mesh_lighting_state_lightness_actual);
  }
}

/***************************************************************************//**
 * @addtogroup BtmeshWrappers
 * @{
 ******************************************************************************/

/***************************************************************************//**
 * Wrapper for mesh_lib_generic_server_respond to log if the Btmesh API call
 * results in error. The parameters and the return value of the wrapper and
 * the wrapped functions are the same.
 ******************************************************************************/
static sl_status_t generic_server_respond(uint16_t model_id,
                                          uint16_t element_index,
                                          uint16_t client_addr,
                                          uint16_t appkey_index,
                                          const struct mesh_generic_state *current,
                                          const struct mesh_generic_state *target,
                                          uint32_t remaining_ms,
                                          uint8_t response_flags)
{
  sl_status_t sc = mesh_lib_generic_server_respond(model_id,
                                                   element_index,
                                                   client_addr,
                                                   appkey_index,
                                                   current,
                                                   target,
                                                   remaining_ms,
                                                   response_flags);

