Realeed/Silabs_BTMesh/EFR32xG22_btmesh_soc_lightness_server/gecko_sdk_4.4.1/app/btmesh/common/btmesh_lighting_server/sl_btmesh_lighting_server.c
  log_status_error_f(sc,
                     "Lighting server respond failed "
                     "(claddr=0x%04x,mdl=0x%04x,elem=%d,state=0x%04x)" NL,
                     client_addr,
                     model_id,
                     element_index,
                     current->kind);
  return sc;
}

/***************************************************************************//**
 * Wrapper for mesh_lib_generic_server_update to log if the Btmesh API call
 * results in error. The parameters and the return value of the wrapper and
 * the wrapped functions are the same.
 ******************************************************************************/
static sl_status_t generic_server_update(uint16_t model_id,
                                         uint16_t element_index,
                                         const struct mesh_generic_state *current,
                                         const struct mesh_generic_state *target,
                                         uint32_t remaining_ms)
{
  sl_status_t sc = mesh_lib_generic_server_update(model_id,
                                                  element_index,
                                                  current,
                                                  target,
                                                  remaining_ms);

  log_status_error_f(sc,
                     "Lighting server state update failed "
                     "(mdl=0x%04x,elem=%d,state=0x%04x)" NL,
                     model_id,
                     element_index,
                     current->kind);
  return sc;
}

/***************************************************************************//**
 * Wrapper for mesh_lib_generic_server_publish to log if the Btmesh API call
 * results in error. The parameters and the return value of the two functions
 * are the same.
 ******************************************************************************/
static sl_status_t generic_server_publish(uint16_t model_id,
                                          uint16_t element_index,
                                          mesh_generic_state_t kind)
{
  sl_status_t sc;

  sc = mesh_lib_generic_server_publish(model_id, element_index, kind);

  log_btmesh_status_f(sc,
                      "Lighting server state publish failed "
                      "(mdl=0x%04x,elem=%d,state=0x%04x)" NL,
                      model_id,
                      element_index,
                      kind);
  return sc;
}

/***************************************************************************//**
 * Wrapper for mesh_lib_generic_server_register_handler with an assert which
 * detects if the Btmesh API call results in error. The parameters of the two
 * functions are the same but the wrapper does not have return value.
 ******************************************************************************/
static void generic_server_register_handler(uint16_t model_id,
                                            uint16_t elem_index,
                                            mesh_lib_generic_server_client_request_cb cb,
                                            mesh_lib_generic_server_change_cb ch,
                                            mesh_lib_generic_server_recall_cb recall)
{
  sl_status_t sc =
    mesh_lib_generic_server_register_handler(model_id, elem_index, cb, ch, recall);

  app_assert_status_f(sc,
                      "Lighting server failed to register handlers "
                      "(mdl=0x%04x,elem=%d)",
                      model_id,
                      elem_index);
}

#ifdef SL_CATALOG_BTMESH_SCENE_SERVER_PRESENT
/***************************************************************************//**
 * Wrapper for sl_btmesh_scene_server_reset_register with an assert which
 * detects if the Btmesh API call results in error. The parameters of the two
 * functions are the same but the wrapper does not have return value.
 * The scene server register shall be reset if the state of the model changes in
 * order to clear the current scene.
 * This function is available only if the btmesh_scene_server component is added
 * to the project.
 ******************************************************************************/
static void scene_server_reset_register_impl(uint16_t elem_index)
{
  sl_status_t sc = sl_btmesh_scene_server_reset_register(elem_index);

  // The function can fail if there is no scene server model in the element or
  // the btmesh_stack_scene_server component is not present. Both of these
  // are configuration issues so assert can be used.
  app_assert_status_f(sc, "Lighting server failed to reset scene register.");
}
#endif

/** @} (end addtogroup BtmeshWrappers) */

// -----------------------------------------------------------------------------
// Timer Callbacks

/***************************************************************************//**
 * Callback for the timer handling generic level move
 *
 * @param[in] handle Pointer to the timer handle
 * @param[in] data   Pointer to the timer data
 ******************************************************************************/
static void lighting_pri_level_move_timer_cb(app_timer_t *handle,
                                             void *data)
{
  (void)data;
  (void)handle;
  // handling of generic level move, update the lightbulb state
  pri_level_move_request();
}

/***************************************************************************//**
 * Callback for the timer handling lightness request transition
 *
 * @param[in] handle Pointer to the timer handle
 * @param[in] data   Pointer to the timer data
 ******************************************************************************/
static void lighting_transition_complete_timer_cb(app_timer_t *handle,
                                                  void *data)
{
  (void)data;
  (void)handle;
  // transition for a lightness request has completed
  // update the lightbulb state
  lightness_transition_complete();
}

/***************************************************************************//**
 * Callback for the timer handling primary generic level request transition
 *
 * @param[in] handle Pointer to the timer handle
 * @param[in] data   Pointer to the timer data
 ******************************************************************************/
static void lighting_level_transition_complete_timer_cb(app_timer_t *handle,
                                                        void *data)
{
  (void)data;
  (void)handle;
  // transition for a primary generic level request has completed,
  // update the lightbulb state
  pri_level_transition_complete();
}

/***************************************************************************//**
 * Callback for the timer handling on/off request transition
 *
 * @param[in] handle Pointer to the timer handle
 * @param[in] data   Pointer to the timer data
 ******************************************************************************/
static void lighting_onoff_transition_complete_timer_cb(app_timer_t *handle,
                                                        void *data)
{
  (void)data;
  (void)handle;
  // transition for an on/off request has completed,
  // update the lightbulb state
  onoff_transition_complete();
}

/***************************************************************************//**
 * Callback for the timer handling delayed primary generic level request
 *
 * @param[in] handle Pointer to the timer handle
 * @param[in] data   Pointer to the timer data
 ******************************************************************************/
static void lighting_delayed_pri_level_timer_cb(app_timer_t *handle,
                                                void *data)
{
  (void)data;
  (void)handle;
  // delay for a primary generic level request has passed,
  // now process the request
  delayed_pri_level_request();
}

/***************************************************************************//**
 * Callback for the timer handling delayed lightness request
 *
 * @param[in] handle Pointer to the timer handle
 * @param[in] data   Pointer to the timer data
 ******************************************************************************/
static void lighting_delayed_lightness_request_timer_cb(app_timer_t *handle,
                                                        void *data)
{
  (void)data;
  (void)handle;
  // delay for a lightness request has passed, now process the request
  delayed_lightness_request();
}

/***************************************************************************//**
 * Callback for the timer handling delayed on/off request
 *
 * @param[in] handle Pointer to the timer handle
 * @param[in] data   Pointer to the timer data
 ******************************************************************************/
static void lighting_delayed_onoff_request_timer_cb(app_timer_t *handle,
                                                    void *data)
{
  (void)data;
  (void)handle;
  // delay for an on/off request has passed, now process the request
  delayed_onoff_request();
}

/***************************************************************************//**
 * Callback for the timer handling storage state change
 *
 * @param[in] handle Pointer to the timer handle
 * @param[in] data   Pointer to the timer data
 ******************************************************************************/
static void lighting_state_store_timer_cb(app_timer_t *handle,
                                          void *data)
{
  (void)data;
  (void)handle;
  // save the lightbulb state
  lightbulb_state_store();
}

/** @} (end addtogroup Lighting Server) */
